CF/Reports/ОценкаПродвиженияТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ОценкаПродвиженияТовара</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МаркетинговаяАкция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МаркетинговаяАкция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Интервал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Диаграмма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

CF/Documents/МаркетинговаяАкция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>МаркетинговаяАкция</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДействиеСкидокНаценок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеАкции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляВсехМагазинов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляВсехМагазиновОдноРасписаниеСкидок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Магазины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Магазин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СкидкиНаценки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Магазин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаНаценка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкидкиНаценки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CF/Reports/ОценкаПродвиженияТовара/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьОтборПоАкцииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Отчет.МаркетинговаяАкция = Результат;
		ПриИзмененииМаркетинговойАкцииСервер();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	
	Отчет.Диаграмма = Найти(ВРЕГ(НаименованиеТекущегоВарианта), "ДИАГРАММА") > 0;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	Перем АдресХранилищаНастроекДляРасшифровки;
	
	Если Параметры.Свойство("ЭтоРасшифровка") Тогда
		
		Параметры.Свойство("Интервал"          , Отчет.Интервал);
		Параметры.Свойство("МаркетинговаяАкция", Отчет.МаркетинговаяАкция);
		
		Если Параметры.Свойство("АдресХранилищаНастроекДляРасшифровки", АдресХранилищаНастроекДляРасшифровки) Тогда
			
			НастройкаРасшифровки = ПолучитьИзВременногоХранилища(АдресХранилищаНастроекДляРасшифровки);
			МаркетинговыеАкцииСервер.ЗаполнитьОтборПоОтбору(Отчет.КомпоновщикНастроек, НастройкаРасшифровки.Отбор);
			МаркетинговыеАкцииСервер.ЗаполнитьПараметрыКомпоновщика(Отчет.КомпоновщикНастроек, НастройкаРасшифровки.ПараметрыДанных);
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Отчет.МаркетинговаяАкция) Тогда
		
		ПриИзмененииМаркетинговойАкцииСервер();
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	ВариантыОтчетов.ПриСохраненииПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьОтборПоАкции(Команда)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "Документ.МаркетинговаяАкция.Форма.ФормаВыбора.Открытие");
             
	ДополнительныеПараметры = Новый Структура;
	ОбработчикОповещения = Новый ОписаниеОповещения("ЗаполнитьОтборПоАкцииЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Документ.МаркетинговаяАкция.ФормаВыбора", , ЭтаФорма, , , , ОбработчикОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриИзмененииМаркетинговойАкцииСервер()
	Перем НачалоПериода, КонецПериода;
	
	Если ЗначениеЗаполнено(Отчет.МаркетинговаяАкция) Тогда
		ДатаНачалаАкции = Отчет.МаркетинговаяАкция.ДатаНачалаДействия;
		ДатаКонцаАкции  = Отчет.МаркетинговаяАкция.ДатаОкончанияДействия;
		Если Не ЗначениеЗаполнено(ДатаКонцаАкции)  Тогда
			ДатаКонцаАкции = КонецДня(ТекущаяДатаСеанса());
		КонецЕсли;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(ДатаКонцаАкции) И ЗначениеЗаполнено(ДатаНачалаАкции) И ДатаКонцаАкции >= ДатаНачалаАкции Тогда
		Если НачалоМесяца(ДатаНачалаАкции) = ДатаНачалаАкции
			И КонецМесяца(ДатаКонцаАкции) = КонецДня(ДатаКонцаАкции) Тогда
			КоличествоМесяцев = Год(ДатаКонцаАкции) * 12 + Месяц(ДатаКонцаАкции) - Год(ДатаНачалаАкции) * 12 - Месяц(ДатаНачалаАкции) + 1;
			НачалоПериода     = ДобавитьМесяц(ДатаНачалаАкции, - КоличествоМесяцев);
			КонецПериода      = ДобавитьМесяц(ДатаКонцаАкции , КоличествоМесяцев);
		Иначе
			КоличествоСекунд = (КонецДня(ДатаКонцаАкции) - ДатаНачалаАкции+1);
			НачалоПериода    = ДатаНачалаАкции - КоличествоСекунд;
			КонецПериода     = ДатаКонцаАкции  + КоличествоСекунд;
		КонецЕсли;
	Иначе
		КонецПериода  = ДатаКонцаАкции;
		НачалоПериода = ДатаНачалаАкции;
	КонецЕсли;
	
	Периоды = Новый Структура;
	Периоды.Вставить("НачалоПериода"  , НачалоПериода);
	Периоды.Вставить("КонецПериода"   , КонецПериода);
	
	МаркетинговыеАкцииСервер.УстановитьОтборСегментовПоМаркетинговойАкции(Отчет.КомпоновщикНастроек, Отчет.МаркетинговаяАкция, Периоды);
	
КонецПроцедуры

#КонецОбласти
